#### Terraform Plan (dev) 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_iam_policy_document.assume_eks-worker_role: Reading...
data.aws_vpc.legacy-vpc: Reading...
data.aws_iam_policy_document.assume_eks_role: Reading...
data.aws_iam_policy_document.assume_eks-worker_role: Read complete after 0s [id=2851119427]
data.aws_iam_policy_document.assume_eks_role: Read complete after 0s [id=3552664922]
aws_iam_role.legacy_eks-worker_role: Refreshing state... [id=dev-legacy-eks-worker-role]
aws_iam_role.legacy_eks_role: Refreshing state... [id=dev-legacy-eks-role]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=dev-legacy-eks-role-20231013181850111100000002]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=dev-legacy-eks-worker-role-20231013181850159500000003]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=dev-legacy-eks-worker-role-20231013181850255300000004]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=dev-legacy-eks-worker-role-20231013181850375900000006]
aws_iam_role_policy_attachment.AmazonEC2RoleforSSM: Refreshing state... [id=dev-legacy-eks-worker-role-20231013181850312500000005]
data.aws_vpc.legacy-vpc: Read complete after 2s [id=vpc-03b302b6de562de7d]
data.aws_subnets.eks_subnets: Reading...
aws_route53_zone.private-zone: Refreshing state... [id=Z00323212BFOW0Y85LEDU]
data.aws_subnets.eks_subnets: Read complete after 0s [id=eu-north-1]
aws_eks_cluster.eks: Refreshing state... [id=dev-master-cluster]
aws_eks_addon.example: Refreshing state... [id=dev-master-cluster:vpc-cni]
aws_eks_node_group.node-group-0: Refreshing state... [id=dev-master-cluster:dev-master-node-group-0]
data.aws_security_group.eks-cluster-sg: Reading...
aws_eks_node_group.node-group-1: Refreshing state... [id=dev-master-cluster:dev-master-node-group-1]
data.aws_security_group.eks-cluster-sg: Read complete after 0s [id=sg-0e996ffcdf694a0b9]
aws_vpc_endpoint.vpce["ssm"]: Refreshing state... [id=vpce-0a18f5f119efe4012]
aws_vpc_endpoint.vpce["ecr.dkr"]: Refreshing state... [id=vpce-0eaaaa0ed3f271be6]
aws_vpc_endpoint.vpce["eks"]: Refreshing state... [id=vpce-07899a9c15a8b7fe8]
aws_vpc_endpoint.vpce["ssmmessages"]: Refreshing state... [id=vpce-044f1497791dc1630]
aws_vpc_endpoint.vpce["ec2messages"]: Refreshing state... [id=vpce-0d32a6ada7ca2d04a]
aws_vpc_endpoint.vpce["ecr.api"]: Refreshing state... [id=vpce-024e451e13e71d19b]
aws_vpc_endpoint.vpce["ec2"]: Refreshing state... [id=vpce-041148a000fa5edd3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_eks_node_group.node-group-0 will be updated in-place
  ~ resource "aws_eks_node_group" "node-group-0" {
        id              = "dev-master-cluster:dev-master-node-group-0"
        tags            = {}
        # (15 unchanged attributes hidden)

      ~ scaling_config {
          ~ desired_size = 1 -> 3
          ~ max_size     = 2 -> 3
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_eks_node_group.node-group-1 will be updated in-place
  ~ resource "aws_eks_node_group" "node-group-1" {
        id              = "dev-master-cluster:dev-master-node-group-1"
        tags            = {}
        # (15 unchanged attributes hidden)

      ~ scaling_config {
          ~ desired_size = 1 -> 3
          ~ max_size     = 2 -> 3
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_vpc_endpoint.vpce["s3"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0e996ffcdf694a0b9",
        ]
      + service_name          = "com.amazonaws.eu-north-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-035d4b07c919e4cdb",
          + "subnet-0dc1fb10b6fd49f03",
        ]
      + tags                  = {
          + "Name" = "vpce-s3"
        }
      + tags_all              = {
          + "Name"        = "vpce-s3"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-03b302b6de562de7d"
    }

  # aws_vpc_endpoint.vpce["sts"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0e996ffcdf694a0b9",
        ]
      + service_name          = "com.amazonaws.eu-north-1.sts"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-035d4b07c919e4cdb",
          + "subnet-0dc1fb10b6fd49f03",
        ]
      + tags                  = {
          + "Name" = "vpce-sts"
        }
      + tags_all              = {
          + "Name"        = "vpce-sts"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-03b302b6de562de7d"
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @carlosgit2016, Action: `pull_request`, Working Directory: ``, Workflow: `scaffold-development`*